IOTracer_tests/ycsb_tests/ycsb_results_ringbuf_notracing
mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 15990
[OVERALL], Throughput(ops/sec), 6253.908692933083
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 60
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.37523452157598497
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 60
[TOTAL_GC_TIME_%], Time(%), 0.37523452157598497
[READ], Operations, 60255
[READ], AverageLatency(us), 145.63988050784167
[READ], MinLatency(us), 90
[READ], MaxLatency(us), 53951
[READ], 95thPercentileLatency(us), 260
[READ], 99thPercentileLatency(us), 451
[READ], Return=OK, 60255
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1439.0
[CLEANUP], MinLatency(us), 1439
[CLEANUP], MaxLatency(us), 1439
[CLEANUP], 95thPercentileLatency(us), 1439
[CLEANUP], 99thPercentileLatency(us), 1439
[UPDATE], Operations, 39745
[UPDATE], AverageLatency(us), 161.83288463957732
[UPDATE], MinLatency(us), 103
[UPDATE], MaxLatency(us), 8791
[UPDATE], 95thPercentileLatency(us), 301
[UPDATE], 99thPercentileLatency(us), 491
[UPDATE], Return=OK, 39745

-------------------------------------------------------------------

mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 16844
[OVERALL], Throughput(ops/sec), 5936.832106388031
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 61
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.3621467584896699
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 61
[TOTAL_GC_TIME_%], Time(%), 0.3621467584896699
[READ], Operations, 60056
[READ], AverageLatency(us), 152.51163913680566
[READ], MinLatency(us), 91
[READ], MaxLatency(us), 8927
[READ], 95thPercentileLatency(us), 291
[READ], 99thPercentileLatency(us), 488
[READ], Return=OK, 60056
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1146.0
[CLEANUP], MinLatency(us), 1146
[CLEANUP], MaxLatency(us), 1146
[CLEANUP], 95thPercentileLatency(us), 1146
[CLEANUP], 99thPercentileLatency(us), 1146
[UPDATE], Operations, 39944
[UPDATE], AverageLatency(us), 172.130833166433
[UPDATE], MinLatency(us), 104
[UPDATE], MaxLatency(us), 49567
[UPDATE], 95thPercentileLatency(us), 331
[UPDATE], 99thPercentileLatency(us), 556
[UPDATE], Return=OK, 39944

-------------------------------------------------------------------

mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 16995
[OVERALL], Throughput(ops/sec), 5884.0835539864665
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 63
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.37069726390114743
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 63
[TOTAL_GC_TIME_%], Time(%), 0.37069726390114743
[READ], Operations, 59891
[READ], AverageLatency(us), 153.56182064083083
[READ], MinLatency(us), 90
[READ], MaxLatency(us), 10319
[READ], 95thPercentileLatency(us), 282
[READ], 99thPercentileLatency(us), 456
[READ], Return=OK, 59891
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1313.0
[CLEANUP], MinLatency(us), 1313
[CLEANUP], MaxLatency(us), 1313
[CLEANUP], 95thPercentileLatency(us), 1313
[CLEANUP], 99thPercentileLatency(us), 1313
[UPDATE], Operations, 40109
[UPDATE], AverageLatency(us), 171.57094417711735
[UPDATE], MinLatency(us), 101
[UPDATE], MaxLatency(us), 48735
[UPDATE], 95thPercentileLatency(us), 327
[UPDATE], 99thPercentileLatency(us), 524
[UPDATE], Return=OK, 40109

-------------------------------------------------------------------

mongo client connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 17047
[OVERALL], Throughput(ops/sec), 5866.134803777791
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 85
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.4986214583211122
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 85
[TOTAL_GC_TIME_%], Time(%), 0.4986214583211122
[READ], Operations, 59906
[READ], AverageLatency(us), 153.90920775882216
[READ], MinLatency(us), 92
[READ], MaxLatency(us), 9487
[READ], 95thPercentileLatency(us), 288
[READ], 99thPercentileLatency(us), 520
[READ], Return=OK, 59906
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1086.0
[CLEANUP], MinLatency(us), 1086
[CLEANUP], MaxLatency(us), 1086
[CLEANUP], 95thPercentileLatency(us), 1086
[CLEANUP], 99thPercentileLatency(us), 1086
[UPDATE], Operations, 40094
[UPDATE], AverageLatency(us), 174.87182620841023
[UPDATE], MinLatency(us), 102
[UPDATE], MaxLatency(us), 49407
[UPDATE], 95thPercentileLatency(us), 330
[UPDATE], 99thPercentileLatency(us), 565
[UPDATE], Return=OK, 40094

-------------------------------------------------------------------